; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-5packages-623seed

(define (problem transport-two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-5packages-623seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 174,789 -> 46,386
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 43)
  ; 46,386 -> 174,789
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 43)
  ; 64,886 -> 46,386
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 50)
  ; 46,386 -> 64,886
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 50)
  ; 64,886 -> 174,789
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 15)
  ; 174,789 -> 64,886
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 15)
  ; 385,597 -> 46,386
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 40)
  ; 46,386 -> 385,597
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 40)
  ; 385,597 -> 174,789
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 29)
  ; 174,789 -> 385,597
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 29)
  ; 385,597 -> 64,886
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 44)
  ; 64,886 -> 385,597
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 44)
  ; 48,40 -> 46,386
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 35)
  ; 46,386 -> 48,40
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 35)
  ; 2676,268 -> 2938,96
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 32)
  ; 2938,96 -> 2676,268
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 32)
  ; 2876,315 -> 2900,906
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 60)
  ; 2900,906 -> 2876,315
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 60)
  ; 2876,315 -> 2938,96
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 23)
  ; 2938,96 -> 2876,315
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 23)
  ; 2876,315 -> 2676,268
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 21)
  ; 2676,268 -> 2876,315
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 21)
  ; 2964,708 -> 2900,906
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 21)
  ; 2900,906 -> 2964,708
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 21)
  ; 2964,708 -> 2676,268
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 53)
  ; 2676,268 -> 2964,708
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 53)
  ; 2964,708 -> 2876,315
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 41)
  ; 2876,315 -> 2964,708
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 41)
  ; 385,597 <-> 2676,268
  (road city-1-loc-4 city-2-loc-3)
  (= (road-length city-1-loc-4 city-2-loc-3) 232)
  (road city-2-loc-3 city-1-loc-4)
  (= (road-length city-2-loc-3 city-1-loc-4) 232)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-1)
  (at package-5 city-1-loc-4)
  (at truck-1 city-2-loc-5)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-3)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-5)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 5
2. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 5
3. (pick-up truck-2 city-1-loc-3 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-4)
   added: (in package-2 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 5
4. (drive truck-2 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 5
5. (pick-up truck-2 city-1-loc-2 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-3 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 5
6. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 5
7. (pick-up truck-2 city-1-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
8. (pick-up truck-2 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
9. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 5
10. (drive truck-2 city-1-loc-4 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 5
11. (drop truck-2 city-2-loc-3 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-1)
   goals met: 1 of 5
12. (drive truck-2 city-2-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 1 of 5
13. (pick-up truck-2 city-1-loc-4 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-4) (capacity truck-2 capacity-1)
   added: (in package-5 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 5
14. (drive truck-2 city-1-loc-4 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-3)
   goals met: 1 of 5
15. (drive truck-2 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-5)
   goals met: 1 of 5
16. (drop truck-2 city-2-loc-5 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-5) (capacity truck-2 capacity-1)
   goals met: 2 of 5
17. (drop truck-2 city-2-loc-5 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-5) (capacity truck-2 capacity-2)
   goals met: 3 of 5
18. (drive truck-2 city-2-loc-5 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-5)
   added: (at truck-2 city-2-loc-1)
   goals met: 3 of 5
19. (drop truck-2 city-2-loc-1 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-2)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-3)
   goals met: 4 of 5
20. (drop truck-2 city-2-loc-1 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-3)
   added: (at package-5 city-2-loc-1) (capacity truck-2 capacity-4)
   goals met: 5 of 5
